quest_system_1944591679_name=^?^Donations for the Temple
quest_system_1944591679_stage_0=^?^Find the Temple of Deceased Souls, and give the money to the abbot of the Temple.
quest_system_1944591679_stage_1=^?^Tell Aron Demion that you have completed your mission successfully.
quest_system_1944591679_stage_2=^?^The donations for the Temple have been stolen.
quest_system_1944591679_task=^?^Aron Demion has entrusted you with the task of delivering some donations to the Temple of Deceased Souls. The way to the Temple is hard and dangerous, for the Temple is in the west, in the Marshan Swamp, near the entrance to the cemetery.<br>This is also a test of your honesty. It would be best to deliver the money to the abbot of the Temple, without touching a single coin in the purse.<br>[reward]
